       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. COMPROGEX2.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT PAYROLL ASSIGN TO "payroll.rpt" 
         ORGANIZATION IS LINE SEQUENTIAL
         ACCESS IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PAYROLL.
01 PRINTLINE PIC X(85).
WORKING-STORAGE SECTION.
01 HOURSWORKED PIC 99V99.
01 RATE PIC 999V99.
01 SSS PIC 9999V99.
01 HDMF PIC 999V99.
01 PHILHEALTH PIC 999V99.
01 TAX PIC 9999V99.
01 BASICPAY PIC 99999V99.
01 DEDUCTIONS PIC 99999V99.
01 NETPAY PIC 9999999V99. 
01 COMPANYNAMEHD.
       02 FILLER PIC X(36) VALUE SPACES.
       02 FILLER PIC X(11) VALUE "BIG COMPANY".
01 COMPANYADDHD.
       02 FILLER PIC X(33) VALUE SPACES.
       02 FILLER PIC X(18) VALUE "BGC, Taguig City".
01 TITLEHD.
       02 FILLER PIC X(38) VALUE SPACES.
       02 FILLER PIC X(7) VALUE "PAYROLL".
01 DETAILSHD.
       02 FILLER PIC X(10) VALUE "EMPLOYEE".
       02 FILLER PIC X(5) VALUE SPACES.
       02 FILLER PIC X(25) VALUE "EMPLOYEE".
       02 FILLER PIC X(5) VALUE SPACES.
       02 FILLER PIC X(10) VALUE "BASIC PAY".
       02 FILLER PIC X(3) VALUE SPACES.
       02 FILLER PIC X(10) VALUE "DEDUCTIONS".
       02 FILLER PIC X(4) VALUE SPACES.
       02 FILLER PIC X(10) VALUE "NET PAY".
01 SUBDETAILSHD.
       02 FILLER PIC X(10) VALUE "NUMBER".
       02 FILLER PIC X(5) VALUE SPACES.
       02 FILLER PIC X(25) VALUE "NAME".
01 PAYROLLINFO.
       02 EMPLOYEENUM PIC X(10).
       02 FILLER PIC X(5) VALUE SPACES.
       02 EMPLOYEENAME PIC X(25).
       02 FILLER PIC X(5) VALUE SPACES.
       02 PRNBASICPAY PIC $$$$$.99.
       02 FILLER PIC X(5) VALUE SPACES.
       02 PRNDEDUCTIONS PIC $$$$$.99.
       02 FILLER PIC X(5) VALUE SPACES.
       02 PRNNETPAY PIC $$$$$$$.99.
PROCEDURE DIVISION.
       OPEN OUTPUT PAYROLL
           WRITE PRINTLINE FROM COMPANYNAMEHD
           WRITE PRINTLINE FROM COMPANYADDHD
           WRITE PRINTLINE FROM TITLEHD
           WRITE PRINTLINE FROM DETAILSHD 
           WRITE PRINTLINE FROM SUBDETAILSHD 
           PERFORM ASKDETAILS
           PERFORM PROCESSREPORT
           WRITE PRINTLINE FROM PAYROLLINFO
       CLOSE PAYROLL
       STOP RUN.
       
       ASKDETAILS.
           DISPLAY "EMPLOYEE NUMBER: " WITH NO ADVANCING
           ACCEPT EMPLOYEENUM
           DISPLAY "EMPLOYEE NAME: " WITH NO ADVANCING
           ACCEPT EMPLOYEENAME
           DISPLAY "HOURS WORKED: " WITH NO ADVANCING
           ACCEPT HOURSWORKED
           DISPLAY "RATE PER HOUR: " WITH NO ADVANCING
           ACCEPT RATE
           DISPLAY "SSS PREMIUM: " WITH NO ADVANCING
           ACCEPT SSS
           DISPLAY "HDMF PREMIUM: " WITH NO ADVANCING
           ACCEPT HDMF
           DISPLAY "PHILHEALTH PREMIUM: " WITH NO ADVANCING
           ACCEPT PHILHEALTH
           DISPLAY "TAX: " WITH NO ADVANCING
           ACCEPT TAX.
           
       PROCESSREPORT.
           COMPUTE BASICPAY = RATE * HOURSWORKED
           COMPUTE DEDUCTIONS = SSS + HDMF + PHILHEALTH + TAX
           COMPUTE NETPAY = BASICPAY - DEDUCTIONS
           MOVE BASICPAY TO PRNBASICPAY
           MOVE DEDUCTIONS TO PRNDEDUCTIONS
           MOVE NETPAY TO PRNNETPAY.