       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. COMPROGEX1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT QUIZSUMM ASSIGN TO "quizSummary.rpt"
         ORGANIZATION IS LINE SEQUENTIAL
         ACCESS IS SEQUENTIAL.
       SELECT STUDDATA  ASSIGN TO "studentData.dat"
         ORGANIZATION IS LINE SEQUENTIAL
         ACCESS IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD QUIZSUMM.
01 PRINTLINE PIC X(80).
FD STUDDATA.
01 PRINTDATA PIC X(80).

WORKING-STORAGE SECTION.
01 PUPHEAD.
       02 FILLER PIC X(19) VALUE SPACES.
       02 FILLER PIC X(41) VALUE "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES".
01 BRHEAD.
       02 FILLER PIC X(31) VALUE SPACES.
       02 FILLER PIC X(18) VALUE "QUEZON CITY BRANCH".
01 SECTHEAD.
       02 FILLER PIC X(36) VALUE SPACES.
       02 FILLER PIC X(8) VALUE "BSIT 2-1".
01 DETAILSHEAD.
       02 FILLER PIC X(10) VALUE "STUDENT".
       02 FILLER PIC X(3) VALUE SPACES.
       02 FILLER PIC X(25) VALUE "STUDENT".
       02 FILLER PIC X(3) VALUE SPACES.
       02 FILLER PIC X(6) VALUE "QUIZ#1".
       02 FILLER PIC X(5) VALUE SPACES.
       02 FILLER PIC X(6) VALUE "QUIZ#2".
       02 FILLER PIC X(5) VALUE SPACES.
       02 FILLER PIC X(6) VALUE "QUIZ#3".
       02 FILLER PIC X(3) VALUE SPACES.
       02 FILLER PIC X(7) VALUE "AVERAGE".
01 SUBDETAILSHEAD.
       02 FILLER PIC X(8) VALUE "NUMBER".
       02 FILLER PIC X(5) VALUE SPACES.
       02 FILLER PIC X(14) VALUE "NAME".
01 READSTUDINFO.
       02 STUDNUM PIC X(10).
       02 FILLER PIC X(3) VALUE SPACES.
       02 STUDNAME PIC X(25).
       02 FILLER PIC X(3) VALUE SPACES.
       02 Q1 PIC 9V999.
       02 FILLER PIC X(8) VALUE SPACES.
       02 Q2 PIC 9V999.
       02 FILLER PIC X(8) VALUE SPACES.
       02 Q3 PIC 9V999.
       02 FILLER PIC X(6) VALUE SPACES.
       02 AVE PIC 9V999.
01 PRINTSTUDINFO.
       02 PRINTSTUDNUM PIC X(10).
       02 FILLER PIC X(3) VALUE SPACES.
       02 PRINTSTUDNAME PIC X(25).
       02 FILLER PIC X(3) VALUE SPACES.
       02 PRNQ1 PIC 9.99.
       02 FILLER PIC X(8) VALUE SPACES.
       02 PRNQ2 PIC 9.99.
       02 FILLER PIC X(8) VALUE SPACES.
       02 PRNQ3 PIC 9.99.
       02 FILLER PIC X(6) VALUE SPACES.
       02 PRNAVE PIC 9.99.
01 SETAVE.
       02 Q1AVE PIC 99V999 VALUE ZERO.
       02 Q2AVE PIC 99V999 VALUE ZERO.
       02 Q3AVE PIC 99V999 VALUE ZERO.
       02 AVEAVE PIC 99V999 VALUE ZERO.
01 FOOTER.
       02 FILLER PIC X(12) VALUE "QUIZ AVERAGE".
       02 FILLER PIC X(29) VALUE SPACES.
       02 PRNQ1AVE PIC 9.99 VALUE ZERO.
       02 FILLER PIC X(8) VALUE SPACES. 
       02 PRNQ2AVE PIC 9.99 VALUE ZERO.
       02 FILLER PIC X(8) VALUE SPACES. 
       02 PRNQ3AVE PIC 9.99 VALUE ZERO.
       02 FILLER PIC X(6) VALUE SPACES. 
       02 PRNAVEAVE PIC 9.99 VALUE ZERO.
01 EOF PIC X VALUE 'N'.
01 DATACOUNT PIC 99 VALUE ZERO.
PROCEDURE DIVISION.
PERFORM ADDDATA 3 TIMES.
PERFORM CREATEREPORT.
STOP RUN.

ADDDATA.
OPEN EXTEND STUDDATA
PERFORM ASKDETAILS
WRITE PRINTDATA FROM READSTUDINFO
END-WRITE
CLOSE STUDDATA.

ASKDETAILS.
DISPLAY "INPUT STUDENT #: " WITH NO ADVANCING
ACCEPT STUDNUM
DISPLAY "INPUT STUDENT NAME: " WITH NO ADVANCING
ACCEPT STUDNAME
DISPLAY "INPUT Q1 GRADE: " WITH NO ADVANCING
ACCEPT Q1
DISPLAY "INPUT Q2 GRADE: " WITH NO ADVANCING
ACCEPT Q2
DISPLAY "INPUT Q3 GRADE: " WITH NO ADVANCING
ACCEPT Q3
COMPUTE AVE = (Q1 + Q2 + Q3)/3.

CREATEREPORT.
OPEN OUTPUT QUIZSUMM
    PERFORM PRINTHEADINGS
    PERFORM IMPORTDATAREPORT
    PERFORM PRINTFOOTER
CLOSE QUIZSUMM.

PRINTHEADINGS.
    WRITE PRINTLINE FROM PUPHEAD
    WRITE PRINTLINE FROM BRHEAD
    WRITE PRINTLINE FROM SECTHEAD
    WRITE PRINTLINE FROM DETAILSHEAD AFTER ADVANCING 1 LINE
    WRITE PRINTLINE FROM SUBDETAILSHEAD AFTER ADVANCING 1 LINE.

IMPORTDATAREPORT.
OPEN INPUT STUDDATA
    PERFORM UNTIL EOF='Y'
      READ STUDDATA INTO READSTUDINFO
      AT END MOVE 'Y' TO EOF
      NOT AT END 
        COMPUTE Q1AVE = Q1AVE + Q1
        COMPUTE Q2AVE = Q2AVE + Q2
        COMPUTE Q3AVE = Q3AVE + Q3
        MOVE STUDNUM TO PRINTSTUDNUM
        MOVE STUDNAME TO PRINTSTUDNAME
        MOVE Q1 TO PRNQ1
        MOVE Q2 TO PRNQ2
        MOVE Q3 TO PRNQ3
        MOVE AVE TO PRNAVE
        WRITE PRINTLINE FROM PRINTSTUDINFO AFTER ADVANCING 1 LINE
        ADD 1 TO DATACOUNT
    END-PERFORM.
CLOSE STUDDATA.

PRINTFOOTER.
    COMPUTE Q1AVE = Q1AVE/DATACOUNT
    COMPUTE Q2AVE = Q2AVE/DATACOUNT
    COMPUTE Q3AVE = Q3AVE/DATACOUNT
    COMPUTE AVEAVE = (Q1AVE + Q2AVE + Q3AVE)/3
    MOVE Q1AVE TO PRNQ1AVE
    MOVE Q2AVE TO PRNQ2AVE
    MOVE Q3AVE TO PRNQ3AVE
    MOVE AVEAVE TO PRNAVEAVE
    WRITE PRINTLINE FROM FOOTER AFTER ADVANCING 3 LINES.
